espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20689/src/sl_icm20689.c
/***************************************************************************//**
 * @file
 * @brief Driver for the Invensense ICM20689 6-axis motion sensor
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include "sl_icm20689.h"

#include <stdint.h>
#include <stdio.h>

#include "em_assert.h"
#include "em_gpio.h"
#include "em_cmu.h"
#include "em_eusart.h"

#include "sl_sleeptimer.h"
#include "sl_icm20689_config.h"

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */
static void sl_icm20689_chip_select_set(bool select);
static sl_status_t sl_icm20689_masked_write(uint8_t addr, uint8_t data, uint8_t mask);

/* Concatenate preprocessor tokens A and B. */
#define SL_CONCAT(A, B) A ## B

/* Generate the cmu clock symbol based on instance. */
#define ICM20689_SPI_CLK(N) SL_CONCAT(cmuClock_EUSART, N)
/** @endcond */

/***************************************************************************//**
 *    Initializes the ICM20689 sensor. Enables the power supply and SPI lines,
 *    sets up the host SPI controller, configures the chip control interface,
 *    clock generator and interrupt line.
 ******************************************************************************/
sl_status_t sl_icm20689_init(void)
{
  uint8_t data;

  /* Enable and setup the SPI bus */
  sl_icm20689_spi_init();

  /* Issue reset */
  sl_icm20689_reset();

  /* Read Who am I register, should get 0x98 */
  sl_icm20689_read_register(ICM20689_REG_WHO_AM_I, 1, &data);

  /* If not - return */
  if (data != ICM20689_DEVICE_ID) {
    return SL_STATUS_INITIALIZATION;
  }

  /* Disable I2C interface, use SPI */
  sl_icm20689_write_register(ICM20689_REG_USER_CTRL, ICM20689_USER_CTRL_BIT_I2C_IF_DIS | ICM20689_USER_CTRL_BIT_SIG_COND_RST);

  /* Set clock select to automatic clock source selection and clear the sleep bit */
  sl_icm20689_write_register(ICM20689_REG_PWR_MGMT_1, _ICM20689_PWR_MGMT_1_CLKSEL_AUTOSEL_0);

  /* PLL startup time - maybe it is too long but better be on the safe side, no spec in the datasheet */
  sl_sleeptimer_delay_millisecond(30);

  /* INT pin: active low, open drain, IT status read clears. It seems that latched mode does not work, the INT pin cannot be cleared if set */
  sl_icm20689_write_register(ICM20689_REG_INT_PIN_CFG, ICM20689_INT_PIN_CFG_BIT_INT_OPEN
                             | ICM20689_INT_PIN_CFG_BIT_INT_LEVEL);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    De-initializes the ICM20689 sensor.
 ******************************************************************************/
sl_status_t sl_icm20689_deinit(void)
{
  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Performs soft reset on the ICM20689 chip
 ******************************************************************************/
sl_status_t sl_icm20689_reset(void)
{
  /* Set H_RESET bit to initiate soft reset */
  sl_icm20689_write_register(ICM20689_REG_PWR_MGMT_1, ICM20689_PWR_MGMT_1_BIT_DEVICE_RESET);

  /* Wait 100ms to complete the reset sequence */
  sl_sleeptimer_delay_millisecond(100);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Reads register from the ICM20689 device
 ******************************************************************************/
sl_status_t sl_icm20689_read_register(uint8_t addr, int num_bytes, uint8_t *data)
{
  /* Enable chip select */
  sl_icm20689_chip_select_set(true);

  /* Set R/W bit to 1 - read */
  EUSART_Spi_TxRx(SL_ICM20689_SPI_EUSART_PERIPHERAL, (addr | 0x80));

  /* Transmit 0's to provide clock and read the data */
  while ( num_bytes-- ) {
    *data++ = EUSART_Spi_TxRx(SL_ICM20689_SPI_EUSART_PERIPHERAL, 0x00);
  }

  /* Disable chip select */
  sl_icm20689_chip_select_set(false);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Writes a register in the ICM20689 device
 ******************************************************************************/
sl_status_t sl_icm20689_write_register(uint8_t addr, uint8_t data)
{
  /* Enable chip select */
  sl_icm20689_chip_select_set(true);

  /* clear R/W bit - write, send the address */
  EUSART_Spi_TxRx(SL_ICM20689_SPI_EUSART_PERIPHERAL, (addr & 0x7F));

  /* Send the data */
  EUSART_Spi_TxRx(SL_ICM20689_SPI_EUSART_PERIPHERAL, data);

  /* Disable chip select */
  sl_icm20689_chip_select_set(false);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Initializes the SPI bus in order to communicate with the ICM20689
 ******************************************************************************/
sl_status_t sl_icm20689_spi_init(void)
{
  EUSART_TypeDef *eusart = SL_ICM20689_SPI_EUSART_PERIPHERAL;
  EUSART_SpiInit_TypeDef init = EUSART_SPI_MASTER_INIT_DEFAULT_HF;
  EUSART_SpiAdvancedInit_TypeDef advancedInit = EUSART_SPI_ADVANCED_INIT_DEFAULT;

  init.bitRate = 3300000UL;
  init.advancedSettings = &advancedInit;

