espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20689/src/sl_icm20689.c
  advancedInit.autoCsEnable = false;
  advancedInit.msbFirst = true;

  /* Enabling clock to EUSART */
  CMU_ClockEnable(ICM20689_SPI_CLK(SL_ICM20689_SPI_EUSART_PERIPHERAL_NO), true);
  CMU_ClockEnable(cmuClock_GPIO, true);

  /* IO configuration */
  GPIO_PinModeSet(SL_ICM20689_SPI_EUSART_TX_PORT, SL_ICM20689_SPI_EUSART_TX_PIN, gpioModePushPull, 0);      /* TX - MOSI */
  GPIO_PinModeSet(SL_ICM20689_SPI_EUSART_RX_PORT, SL_ICM20689_SPI_EUSART_RX_PIN, gpioModeInput, 0);         /* RX - MISO */
  GPIO_PinModeSet(SL_ICM20689_SPI_EUSART_SCLK_PORT, SL_ICM20689_SPI_EUSART_SCLK_PIN, gpioModePushPull, 0);  /* Clock */
  GPIO_PinModeSet(SL_ICM20689_SPI_EUSART_CS_PORT, SL_ICM20689_SPI_EUSART_CS_PIN, gpioModePushPull, 1);      /* CS */

  /* Initialize EUSART, in SPI master mode. */
  EUSART_SpiInit(eusart, &init);

  /* Enable pins at correct EUSART location. */
  GPIO->EUSARTROUTE[SL_ICM20689_SPI_EUSART_PERIPHERAL_NO].TXROUTE = ((SL_ICM20689_SPI_EUSART_TX_PORT << _GPIO_EUSART_TXROUTE_PORT_SHIFT) | (SL_ICM20689_SPI_EUSART_TX_PIN << _GPIO_EUSART_TXROUTE_PIN_SHIFT));
  GPIO->EUSARTROUTE[SL_ICM20689_SPI_EUSART_PERIPHERAL_NO].RXROUTE = ((SL_ICM20689_SPI_EUSART_RX_PORT << _GPIO_EUSART_RXROUTE_PORT_SHIFT) | (SL_ICM20689_SPI_EUSART_RX_PIN << _GPIO_EUSART_RXROUTE_PIN_SHIFT));
  GPIO->EUSARTROUTE[SL_ICM20689_SPI_EUSART_PERIPHERAL_NO].SCLKROUTE = ((SL_ICM20689_SPI_EUSART_SCLK_PORT << _GPIO_EUSART_SCLKROUTE_PORT_SHIFT) | (SL_ICM20689_SPI_EUSART_SCLK_PIN << _GPIO_EUSART_SCLKROUTE_PIN_SHIFT));
  GPIO->EUSARTROUTE[SL_ICM20689_SPI_EUSART_PERIPHERAL_NO].ROUTEEN = GPIO_EUSART_ROUTEEN_RXPEN | GPIO_EUSART_ROUTEEN_TXPEN | GPIO_EUSART_ROUTEEN_SCLKPEN;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Sets the sample rate both of the accelerometer and the gyroscope.
 ******************************************************************************/
float sl_icm20689_set_sample_rate(float sample_rate)
{
#define INTERNAL_SAMPLE_RATE (1000.0)

  uint8_t div;

  /* Calculate the sample rate divider */
  sample_rate = (INTERNAL_SAMPLE_RATE / sample_rate) - 1.0;

  /* Check if it fits in the divider registers */
  if ( sample_rate > 255.0 ) {
    sample_rate = 255.0;
  }

  if ( sample_rate < 0.0 ) {
    sample_rate = 0.0;
  }

  /* Write the value to the registers */
  div = (uint8_t) sample_rate;
  sl_icm20689_write_register(ICM20689_REG_SMPLRT_DIV, div);

  /* Calculate the actual sample rate from the divider value */
  sample_rate = INTERNAL_SAMPLE_RATE / (div + 1);

  return sample_rate;
}

/***************************************************************************//**
 *    Sets the bandwidth of the gyroscope
 ******************************************************************************/
sl_status_t sl_icm20689_gyro_set_bandwidth(sl_gyro_bandwidth_t gyro_bandwidth)
{
  uint8_t f_choice, dlpf_config;

  f_choice = (gyro_bandwidth >> GYRO_BANDWITDH_ENUM_FCHOICE_SHIFT) & ICM20689_GYRO_CONFIG_MASK_FCHOICE_B;
  dlpf_config = gyro_bandwidth & ICM20689_CONFIG_MASK_DLPF_CFG;

  /* Read the GYRO_CONFIG register */
  sl_icm20689_masked_write(ICM20689_REG_GYRO_CONFIG, f_choice << ICM20689_GYRO_CONFIG_SHIFT_FCHOICE_B, ICM20689_GYRO_CONFIG_MASK_FCHOICE_B);

  /* Read the CONFIG register */
  sl_icm20689_masked_write(ICM20689_REG_CONFIG, dlpf_config << ICM20689_CONFIG_SHIFT_DLPF_CFG, ICM20689_CONFIG_MASK_DLPF_CFG);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Sets the bandwidth of the accelerometer
 ******************************************************************************/
sl_status_t sl_icm20689_accel_set_bandwidth(sl_accel_bandwidth_t accel_bandwidth)
{
  return sl_icm20689_masked_write(ICM20689_REG_ACCEL_CONFIG2, accel_bandwidth, (ICM20689_ACCEL_CONFIG2_MASK_A_DLPF_CFG
                                                                                | ICM20689_ACCEL_CONFIG2_MASK_ACCEL_FCHOICE_B));
}

/***************************************************************************//**
 *    Reads the raw acceleration value and converts to g value based on
 *    the actual resolution
 ******************************************************************************/
sl_status_t sl_icm20689_accel_read_data(float accel[3])
{
  uint8_t raw_data[6];
  float accel_res;
  int16_t temp;

  /* Retrieve the current resolution */
  sl_icm20689_accel_get_resolution(&accel_res);

  /* Read the six raw data registers into data array */
  sl_icm20689_read_register(ICM20689_REG_ACCEL_XOUT_H, 6, &raw_data[0]);

  /* Convert the MSB and LSB into a signed 16-bit value and multiply by the resolution to get the dps value */
  temp = ( (int16_t) raw_data[0] << 8) | raw_data[1];
  accel[0] = (float) temp * accel_res;

  temp = ( (int16_t) raw_data[2] << 8) | raw_data[3];
  accel[1] = (float) temp * accel_res;

  temp = ( (int16_t) raw_data[4] << 8) | raw_data[5];
  accel[2] = (float) temp * accel_res;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Reads the raw gyroscope value and converts to deg/sec value based on
 *    the actual resolution
 ******************************************************************************/
sl_status_t sl_icm20689_gyro_read_data(float gyro[3])
{
  uint8_t raw_data[6];
  float gyro_res;
  int16_t temp;

  /* Read the six raw data registers into data array */
  sl_icm20689_read_register(ICM20689_REG_GYRO_XOUT_H, 6, &raw_data[0]);

  /* Retrieve the current resolution */
  sl_icm20689_gyro_get_resolution(&gyro_res);

  /* Convert the MSB and LSB into a signed 16-bit value and multiply by the resolution to get the dps value */
  temp = ( (int16_t) raw_data[0] << 8) | raw_data[1];
  gyro[0] = (float) temp * gyro_res;

  temp = ( (int16_t) raw_data[2] << 8) | raw_data[3];
  gyro[1] = (float) temp * gyro_res;

  temp = ( (int16_t) raw_data[4] << 8) | raw_data[5];
  gyro[2] = (float) temp * gyro_res;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Gets the actual resolution of the accelerometer
 ******************************************************************************/
sl_status_t sl_icm20689_accel_get_resolution(float *accel_res)
{
  uint8_t reg;

  /* Read the actual acceleration full scale setting */
  sl_icm20689_read_register(ICM20689_REG_ACCEL_CONFIG, 1, &reg);
  reg &= ICM20689_ACCEL_CONFIG_MASK_ACCEL_FS_SEL;

