espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20689/src/sl_icm20689.c
  /* Calculate the resolution */
  switch ( reg ) {
    case ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_2G:
      *accel_res = 2.0 / 32768.0;
      break;

    case ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_4G:
      *accel_res = 4.0 / 32768.0;
      break;

    case ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_8G:
      *accel_res = 8.0 / 32768.0;
      break;

    case ICM20689_ACCEL_CONFIG_ACCEL_FS_SEL_16G:
      *accel_res = 16.0 / 32768.0;
      break;

    default:
      EFM_ASSERT(false);
      return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Gets the actual resolution of the gyroscope
 ******************************************************************************/
sl_status_t sl_icm20689_gyro_get_resolution(float *gyro_res)
{
  uint8_t reg;

  /* Read the actual gyroscope full scale setting */
  sl_icm20689_read_register(ICM20689_REG_GYRO_CONFIG, 1, &reg);
  reg &= ICM20689_GYRO_CONFIG_MASK_FS_SEL;

  /* Calculate the resolution */
  switch ( reg ) {
    case ICM20689_GYRO_CONFIG_FS_SEL_250_DPS:
      *gyro_res = 250.0 / 32768.0;
      break;

    case ICM20689_GYRO_CONFIG_FS_SEL_500_DPS:
      *gyro_res = 500.0 / 32768.0;
      break;

    case ICM20689_GYRO_CONFIG_FS_SEL_1000_DPS:
      *gyro_res = 1000.0 / 32768.0;
      break;

    case ICM20689_GYRO_CONFIG_FS_SEL_2000_DPS:
      *gyro_res = 2000.0 / 32768.0;
      break;

    default:
      EFM_ASSERT(false);
      return SL_STATUS_FAIL;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Sets the full scale value of the accelerometer
 ******************************************************************************/
sl_status_t sl_icm20689_accel_set_full_scale(sl_accel_full_scale_t accel_fs)
{
  uint8_t reg;

  sl_icm20689_read_register(ICM20689_REG_ACCEL_CONFIG, 1, &reg);

  reg &= ~(ICM20689_ACCEL_CONFIG_MASK_ACCEL_FS_SEL);
  reg |= accel_fs;

  sl_icm20689_write_register(ICM20689_REG_ACCEL_CONFIG, reg);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Sets the full scale value of the gyroscope
 ******************************************************************************/
sl_status_t sl_icm20689_gyro_set_full_scale(sl_gyro_full_scale_t gyro_fs)
{
  uint8_t reg;

  sl_icm20689_read_register(ICM20689_REG_GYRO_CONFIG, 1, &reg);

  reg &= ~(ICM20689_GYRO_CONFIG_MASK_FS_SEL);
  reg |= gyro_fs;

  sl_icm20689_write_register(ICM20689_REG_GYRO_CONFIG, reg);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Enables or disables the sleep mode of the device
 ******************************************************************************/
sl_status_t sl_icm20689_enable_sleep_mode(bool enable)
{
  uint8_t data;

  if ( enable ) {
    /* Sleep: set the SLEEP bit */
    data = ICM20689_PWR_MGMT_1_BIT_SLEEP;
  } else {
    /* Wake up: clear the SLEEP bit */
    data = 0;
  }

  return sl_icm20689_masked_write(ICM20689_REG_PWR_MGMT_1, data, ICM20689_PWR_MGMT_1_MASK_SLEEP);
}

/***************************************************************************//**
 *    Enables or disables the sensors in the ICM20689 chip
 ******************************************************************************/
sl_status_t sl_icm20689_enable_sensor(bool accel, bool gyro, bool temp)
{
  uint8_t pwrManagement1;
  uint8_t pwrManagement2;

  pwrManagement1 = 0U;
  pwrManagement2 = 0U;

  /* To enable the temperature sensor clear the TEMP_DIS bit in PWR_MGMT_1 */
  if (!temp) {
    pwrManagement1 = ICM20689_PWR_MGMT_1_BIT_TEMP_DIS;
  }

  /* To enable the accelerometer clear the DISABLE_ACCEL bits in PWR_MGMT_2 */
  if (!accel) {
    pwrManagement2 |= ICM20689_PWR_MGMT_2_BIT_STBY_ZA
                      | ICM20689_PWR_MGMT_2_BIT_STBY_YA
                      | ICM20689_PWR_MGMT_2_BIT_STBY_XA;
  }

  /* To enable gyro clear the DISABLE_GYRO bits in PWR_MGMT_2 */
  if (!gyro) {
    pwrManagement2 |= ICM20689_PWR_MGMT_2_BIT_STBY_ZG
                      | ICM20689_PWR_MGMT_2_BIT_STBY_YG
                      | ICM20689_PWR_MGMT_2_BIT_STBY_XG;
  }

  /* Write back the modified values */
  sl_icm20689_masked_write(ICM20689_REG_PWR_MGMT_1, pwrManagement1, ICM20689_PWR_MGMT_1_MASK_TEMP_DIS);

  sl_icm20689_masked_write(ICM20689_REG_PWR_MGMT_2, pwrManagement2, ICM20689_PWR_MGMT_2_MASK_STBY_ZG
                           | ICM20689_PWR_MGMT_2_MASK_STBY_YG
                           | ICM20689_PWR_MGMT_2_MASK_STBY_XG
                           | ICM20689_PWR_MGMT_2_MASK_STBY_ZA
                           | ICM20689_PWR_MGMT_2_MASK_STBY_YA
                           | ICM20689_PWR_MGMT_2_MASK_STBY_XA);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Enables or disables the interrupts in the ICM20689 chip
 ******************************************************************************/
sl_status_t sl_icm20689_enable_interrupt(bool data_ready_enable, bool wom_enable)
{
  uint8_t int_enable;

  /* All interrupts disabled by default */
  int_enable = 0;

  /* Enable one or both of the interrupt sources if required */
  if ( wom_enable ) {
    int_enable |= ICM20689_INT_ENABLE_MASK_WOM_INT_EN;
  }

  if ( data_ready_enable ) {
    int_enable |= ICM20689_INT_ENABLE_MASK_DATA_RDY_INT_EN;
  }

  /* Write value to register */
  sl_icm20689_masked_write(ICM20689_REG_INT_ENABLE, int_enable, ICM20689_INT_ENABLE_MASK_DATA_RDY_INT_EN | ICM20689_INT_ENABLE_MASK_WOM_INT_EN);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Reads the interrupt status registers of the ICM20689 chip
 ******************************************************************************/
sl_status_t sl_icm20689_read_interrupt_status(uint32_t *int_status)
{
  uint8_t reg[4];

  sl_icm20689_read_register(ICM20689_REG_INT_STATUS, 4, reg);
  *int_status = (uint32_t) reg[0];
  *int_status |= ( ( (uint32_t) reg[1]) << 8);
  *int_status |= ( ( (uint32_t) reg[2]) << 16);
  *int_status |= ( ( (uint32_t) reg[3]) << 24);

