espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20689/src/sl_icm20689.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Checks if new data is available for read
 ******************************************************************************/
bool sl_icm20689_is_data_ready(void)
{
  uint8_t status;
  bool ret;

  ret = false;
  sl_icm20689_read_register(ICM20689_REG_INT_STATUS, 1, &status);

  if ( status & ICM20689_INT_STATUS_BIT_DATA_RDY_INT ) {
    ret = true;
  }

  return ret;
}

/***************************************************************************//**
 *    Accelerometer and gyroscope calibration function. Reads the gyroscope
 *    and accelerometer values while the device is at rest and in level. The
 *    resulting values are loaded to the accel and gyro bias registers to cancel
 *    the static offset error.
 ******************************************************************************/
sl_status_t sl_icm20689_calibrate_accel_and_gyro(float *accel_bias_scaled, float *gyro_bias_scaled)
{
#define FIFO_SAMPLE_COUNT (12 * 42)

  uint8_t data[12];
  uint16_t i, packet_count, fifo_count;
  int32_t gyro_bias[3] = { 0, 0, 0 };
  int32_t accel_bias[3] = { 0, 0, 0 };
  int32_t accel_temp[3];
  int32_t gyro_temp[3];
  int32_t accel_bias_factory[3];
  int32_t gyro_bias_stored[3];
  float gyro_res, accel_res;

  sl_icm20689_enable_sensor(false, false, false);

  /* Set 1kHz sample rate */
  sl_icm20689_set_sample_rate(1000.0);

  /* 246Hz BW for the accelerometer and 200Hz for the gyroscope */
  sl_icm20689_accel_set_bandwidth(sl_accelBandwidthDlpf218_1_0Hz);
  sl_icm20689_gyro_set_bandwidth(sl_gyroBandwidthDlpf176Hz);

  /* Set the most sensitive range: 2G full scale and 250dps full scale */
  sl_icm20689_accel_set_full_scale(sl_accelFullscale2G);
  sl_icm20689_gyro_set_full_scale(sl_gyroFullscale250Dps);

  /* Retrieve the resolution per bit */
  sl_icm20689_accel_get_resolution(&accel_res);
  sl_icm20689_gyro_get_resolution(&gyro_res);

  /* Disable the FIFO */
  sl_icm20689_write_register(ICM20689_REG_CONFIG, ICM20689_CONFIG_BIT_FIFO_MODE);

  /* Enable the accelerometer and the gyro */
  sl_icm20689_enable_sensor(true, true, false);

  /* The accel sensor needs max 30ms, the gyro max 35ms to fully start */
  /* Experiments show that the gyro needs more time to get reliable results */
  sl_sleeptimer_delay_millisecond(50);

  /* Reset the FIFO */
  sl_icm20689_write_register(ICM20689_REG_USER_CTRL, ICM20689_USER_CTRL_BIT_FIFO_EN | ICM20689_USER_CTRL_BIT_FIFO_RST);

  // Enable the different sensors to write to the FIFO
  sl_icm20689_write_register(ICM20689_REG_FIFO_EN, ICM20689_FIFO_EN_BIT_ACCEL_FIFO_EN
                             | ICM20689_FIFO_EN_BIT_ZG_FIFO_EN
                             | ICM20689_FIFO_EN_BIT_YG_FIFO_EN
                             | ICM20689_FIFO_EN_BIT_XG_FIFO_EN);

  /* The max FIFO size is 4096 bytes, but is limited to 512. */
  fifo_count = 0;
  while ( fifo_count < FIFO_SAMPLE_COUNT ) {
    sl_sleeptimer_delay_millisecond(5);
    /* Read FIFO sample count */
    sl_icm20689_read_register(ICM20689_REG_FIFO_COUNTH, 2, &data[0]);
    /* Convert to a 16 bit value */
    fifo_count = ( (uint16_t) (data[0] << 8) | data[1]);
  }

  /* Disable accelerometer and gyro to store the data in FIFO */
  sl_icm20689_masked_write(ICM20689_REG_FIFO_EN, 0U, ICM20689_FIFO_EN_MASK_ACCEL_FIFO_EN
                           | ICM20689_FIFO_EN_MASK_ZG_FIFO_EN
                           | ICM20689_FIFO_EN_MASK_YG_FIFO_EN
                           | ICM20689_FIFO_EN_MASK_XG_FIFO_EN);

  /* Read FIFO sample count */
  sl_icm20689_read_register(ICM20689_REG_FIFO_COUNTH, 2, &data[0]);

  /* Convert to a 16 bit value */
  fifo_count = ( (uint16_t) (data[0] << 8) | data[1]);

  /* Calculate the number of data sets (3 axis of accel an gyro, two bytes each = 12 bytes) */
  packet_count = fifo_count / 12;
  /* Retrieve the data from the FIFO */
  for ( i = 0; i < packet_count; i++ ) {
    sl_icm20689_read_register(ICM20689_REG_FIFO_R_W, sizeof(data), &data[0]);
    /* Convert to 16 bit signed accel and gyro x,y and z values */
    accel_temp[0] = ( (int16_t) (data[0] << 8) | data[1]);
    accel_temp[1] = ( (int16_t) (data[2] << 8) | data[3]);
    accel_temp[2] = ( (int16_t) (data[4] << 8) | data[5]);
    gyro_temp[0] = ( (int16_t) (data[6] << 8) | data[7]);
    gyro_temp[1] = ( (int16_t) (data[8] << 8) | data[9]);
    gyro_temp[2] = ( (int16_t) (data[10] << 8) | data[11]);

    /* Sum the values */
    accel_bias[0] += accel_temp[0];
    accel_bias[1] += accel_temp[1];
    accel_bias[2] += accel_temp[2];
    gyro_bias[0] += gyro_temp[0];
    gyro_bias[1] += gyro_temp[1];
    gyro_bias[2] += gyro_temp[2];
  }

  /* Divide by packet count to get the average */
  accel_bias[0] /= packet_count;
  accel_bias[1] /= packet_count;
  accel_bias[2] /= packet_count;
  gyro_bias[0] /= packet_count;
  gyro_bias[1] /= packet_count;
  gyro_bias[2] /= packet_count;

  /* Acceleormeter: add or remove (depending on the orientation of the chip) 1G (gravity) from the Z axis value */
  if ( accel_bias[2] > 0L ) {
    accel_bias[2] -= (int32_t) (1.0 / accel_res);
  } else {
    accel_bias[2] += (int32_t) (1.0 / accel_res);
  }

  /* Convert the values to degrees per sec for displaying */
  gyro_bias_scaled[0] = (float) gyro_bias[0] * gyro_res;
  gyro_bias_scaled[1] = (float) gyro_bias[1] * gyro_res;
  gyro_bias_scaled[2] = (float) gyro_bias[2] * gyro_res;

  /* Read stored gyro trim values. After reset these values are all 0 */
  sl_icm20689_read_register(ICM20689_REG_XG_OFFS_USRH, 2, &data[0]);
  gyro_bias_stored[0] = ( (int16_t) (data[0] << 8) | data[1]);
  sl_icm20689_read_register(ICM20689_REG_YG_OFFS_USRH, 2, &data[0]);
  gyro_bias_stored[1] = ( (int16_t) (data[0] << 8) | data[1]);
  sl_icm20689_read_register(ICM20689_REG_ZG_OFFS_USRH, 2, &data[0]);
  gyro_bias_stored[2] = ( (int16_t) (data[0] << 8) | data[1]);

  /* The gyro bias should be stored in 1000dps full scaled format. We measured in 250dps to get */
  /* the best sensitivity, so need to divide by 4 */
  /* Substract from the stored calibration value */
  gyro_bias_stored[0] -= gyro_bias[0] / 4;
  gyro_bias_stored[1] -= gyro_bias[1] / 4;
  gyro_bias_stored[2] -= gyro_bias[2] / 4;

  /* Split the values into two bytes */
  data[0] = (gyro_bias_stored[0] >> 8) & 0xFF;
  data[1] = (gyro_bias_stored[0]) & 0xFF;
  data[2] = (gyro_bias_stored[1] >> 8) & 0xFF;
  data[3] = (gyro_bias_stored[1]) & 0xFF;
  data[4] = (gyro_bias_stored[2] >> 8) & 0xFF;
  data[5] = (gyro_bias_stored[2]) & 0xFF;

  /* Write the  gyro bias values to the chip */
  sl_icm20689_write_register(ICM20689_REG_XG_OFFS_USRH, data[0]);
  sl_icm20689_write_register(ICM20689_REG_XG_OFFS_USRL, data[1]);
  sl_icm20689_write_register(ICM20689_REG_YG_OFFS_USRH, data[2]);
  sl_icm20689_write_register(ICM20689_REG_YG_OFFS_USRL, data[3]);
  sl_icm20689_write_register(ICM20689_REG_ZG_OFFS_USRH, data[4]);
  sl_icm20689_write_register(ICM20689_REG_ZG_OFFS_USRL, data[5]);

  /* Calculate the accelerometer bias values to store in the hardware accelerometer bias registers. These registers contain */
  /* factory trim values which must be added to the calculated accelerometer biases; on boot up these registers will hold */
  /* non-zero values. In addition, bit 0 of the lower byte must be preserved since it is used for temperature */
  /* compensation calculations(? the datasheet is not clear). Accelerometer bias registers expect bias input */
  /* as 2048 LSB per g, so that the accelerometer biases calculated above must be divided by 8. */

  /* Read factory accelerometer trim values */
  sl_icm20689_read_register(ICM20689_REG_XA_OFFSET_H, 2, &data[0]);
  accel_bias_factory[0] = ( (int16_t) (data[0] << 8) | data[1]);
  sl_icm20689_read_register(ICM20689_REG_YA_OFFSET_H, 2, &data[0]);
  accel_bias_factory[1] = ( (int16_t) (data[0] << 8) | data[1]);
  sl_icm20689_read_register(ICM20689_REG_ZA_OFFSET_H, 2, &data[0]);
  accel_bias_factory[2] = ( (int16_t) (data[0] << 8) | data[1]);

  /* Construct total accelerometer bias, including calculated average accelerometer bias from above */
  /* Scale the 2g full scale (most sensitive range) results to 16g full scale - divide by 8 */
  /* Clear the last bit (temperature compensation? - the datasheet is not clear) */
  /* Substract from the factory calibration value */

  accel_bias_factory[0] -= ( (accel_bias[0] / 8) & ~1);
  accel_bias_factory[1] -= ( (accel_bias[1] / 8) & ~1);
  accel_bias_factory[2] -= ( (accel_bias[2] / 8) & ~1);

  /* Split the values into two bytes */
  data[0] = (accel_bias_factory[0] >> 8) & 0xFF;
  data[1] = (accel_bias_factory[0]) & 0xFF;
  data[2] = (accel_bias_factory[1] >> 8) & 0xFF;
  data[3] = (accel_bias_factory[1]) & 0xFF;
  data[4] = (accel_bias_factory[2] >> 8) & 0xFF;
  data[5] = (accel_bias_factory[2]) & 0xFF;

