espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20689/src/sl_icm20689.c
  /* Store them in the accelerometer offset registers */
  sl_icm20689_write_register(ICM20689_REG_XA_OFFSET_H, data[0]);
  sl_icm20689_write_register(ICM20689_REG_XA_OFFSET_L, data[1]);
  sl_icm20689_write_register(ICM20689_REG_YA_OFFSET_H, data[2]);
  sl_icm20689_write_register(ICM20689_REG_YA_OFFSET_L, data[3]);
  sl_icm20689_write_register(ICM20689_REG_ZA_OFFSET_H, data[4]);
  sl_icm20689_write_register(ICM20689_REG_ZA_OFFSET_L, data[5]);

  /* Convert the values to G for displaying */
  accel_bias_scaled[0] = (float) accel_bias[0] * accel_res;
  accel_bias_scaled[1] = (float) accel_bias[1] * accel_res;
  accel_bias_scaled[2] = (float) accel_bias[2] * accel_res;

  /* Turn off FIFO */
  sl_icm20689_masked_write(ICM20689_REG_USER_CTRL, 0x00, ICM20689_USER_CTRL_MASK_FIFO_EN);

  /* Disable all sensors */
  sl_icm20689_enable_sensor(false, false, false);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Gyroscope calibration function. Reads the gyroscope
 *    values while the device is at rest and in level. The
 *    resulting values are loaded to the gyro bias registers to cancel
 *    the static offset error.
 ******************************************************************************/
sl_status_t sl_icm20689_calibrate_gyro(float *gyro_bias_scaled)
{
#define FIFO_SAMPLE_COUNT (12 * 42)

  uint8_t data[12];
  uint16_t i, packet_count, fifo_count;
  int32_t gyro_bias[3] = { 0, 0, 0 };
  int32_t gyro_temp[3];
  int32_t gyro_bias_stored[3];
  float gyro_res;

  /* Enable the accelerometer and the gyro */
  sl_icm20689_enable_sensor(true, true, false);

  /* Set 1kHz sample rate */
  sl_icm20689_set_sample_rate(1000.0);

  /* Configure bandwidth for gyroscope to 10Hz */
  sl_icm20689_gyro_set_bandwidth(sl_gyroBandwidthDlpf10Hz);

  /* Configure sensitivity to 250dps full scale */
  sl_icm20689_gyro_set_full_scale(sl_gyroFullscale250Dps);

  /* Retrieve the resolution per bit */
  sl_icm20689_gyro_get_resolution(&gyro_res);

  /* The accel sensor needs max 30ms, the gyro max 35ms to fully start */
  /* Experiments show that the gyro needs more time to get reliable results */
  sl_sleeptimer_delay_millisecond(50);

  sl_icm20689_write_register(ICM20689_REG_CONFIG, ICM20689_CONFIG_BIT_FIFO_MODE);

  /* Disable the FIFO and reset the FIFO */
  sl_icm20689_write_register(ICM20689_REG_USER_CTRL, ICM20689_USER_CTRL_BIT_FIFO_EN | ICM20689_USER_CTRL_BIT_FIFO_RST);

  /* Enable accelerometer and gyro to store the data in FIFO */
  sl_icm20689_write_register(ICM20689_REG_FIFO_EN, ICM20689_FIFO_EN_BIT_ACCEL_FIFO_EN
                             | ICM20689_FIFO_EN_BIT_ZG_FIFO_EN
                             | ICM20689_FIFO_EN_BIT_YG_FIFO_EN
                             | ICM20689_FIFO_EN_BIT_XG_FIFO_EN);

  /* The max FIFO size is 4096 bytes, but is limited to 512. */
  fifo_count = 0;
  while ( fifo_count < FIFO_SAMPLE_COUNT ) {
    sl_sleeptimer_delay_millisecond(5);

    /* Read FIFO sample count */
    sl_icm20689_read_register(ICM20689_REG_FIFO_COUNTH, 2, &data[0]);

    /* Convert to a 16 bit value */
    fifo_count = ( (uint16_t) (data[0] << 8) | data[1]);
  }

  /* Disable accelerometer and gyro to store the data in FIFO */
  sl_icm20689_masked_write(ICM20689_REG_FIFO_EN, 0U, ICM20689_FIFO_EN_MASK_ACCEL_FIFO_EN
                           | ICM20689_FIFO_EN_MASK_ZG_FIFO_EN
                           | ICM20689_FIFO_EN_MASK_YG_FIFO_EN
                           | ICM20689_FIFO_EN_MASK_XG_FIFO_EN);

  /* Read FIFO sample count */
  sl_icm20689_read_register(ICM20689_REG_FIFO_COUNTH, 2, &data[0]);

  /* Convert to a 16 bit value */
  fifo_count = ( (uint16_t) (data[0] << 8) | data[1]);

  /* Calculate the number of data sets (3 axis of accel an gyro, two bytes each = 12 bytes) */
  packet_count = fifo_count / 12;

  /* Retrieve the data from the FIFO */
  for ( i = 0; i < packet_count; i++ ) {
    sl_icm20689_read_register(ICM20689_REG_FIFO_R_W, 12, &data[0]);
    /* Convert to 16 bit signed accel and gyro x,y and z values */
    gyro_temp[0] = ( (int16_t) (data[6] << 8) | data[7]);
    gyro_temp[1] = ( (int16_t) (data[8] << 8) | data[9]);
    gyro_temp[2] = ( (int16_t) (data[10] << 8) | data[11]);

    /* Sum the values */
    gyro_bias[0] += gyro_temp[0];
    gyro_bias[1] += gyro_temp[1];
    gyro_bias[2] += gyro_temp[2];
  }

  /* Divide by packet count to get the average */
  gyro_bias[0] /= packet_count;
  gyro_bias[1] /= packet_count;
  gyro_bias[2] /= packet_count;

  /* Convert the values to degrees per sec for displaying */
  gyro_bias_scaled[0] = (float) gyro_bias[0] * gyro_res;
  gyro_bias_scaled[1] = (float) gyro_bias[1] * gyro_res;
  gyro_bias_scaled[2] = (float) gyro_bias[2] * gyro_res;

  /* Read stored gyro trim values. After reset these values are all 0 */
  sl_icm20689_read_register(ICM20689_REG_XG_OFFS_USRH, 2, &data[0]);
  gyro_bias_stored[0] = ( (int16_t) (data[0] << 8) | data[1]);

  sl_icm20689_read_register(ICM20689_REG_YG_OFFS_USRH, 2, &data[0]);
  gyro_bias_stored[1] = ( (int16_t) (data[0] << 8) | data[1]);

  sl_icm20689_read_register(ICM20689_REG_ZG_OFFS_USRH, 2, &data[0]);
  gyro_bias_stored[2] = ( (int16_t) (data[0] << 8) | data[1]);

  /* The gyro bias should be stored in 1000dps full scaled format. We measured in 250dps to get */
  /* the best sensitivity, so need to divide by 4 */
  /* Substract from the stored calibration value */
  gyro_bias_stored[0] -= gyro_bias[0] / 4;
  gyro_bias_stored[1] -= gyro_bias[1] / 4;
  gyro_bias_stored[2] -= gyro_bias[2] / 4;

  /* Split the values into two bytes */
  data[0] = (gyro_bias_stored[0] >> 8) & 0xFF;
  data[1] = (gyro_bias_stored[0]) & 0xFF;
  data[2] = (gyro_bias_stored[1] >> 8) & 0xFF;
  data[3] = (gyro_bias_stored[1]) & 0xFF;
  data[4] = (gyro_bias_stored[2] >> 8) & 0xFF;
  data[5] = (gyro_bias_stored[2]) & 0xFF;

  /* Write the  gyro bias values to the chip */
  sl_icm20689_write_register(ICM20689_REG_XG_OFFS_USRH, data[0]);
  sl_icm20689_write_register(ICM20689_REG_XG_OFFS_USRL, data[1]);
  sl_icm20689_write_register(ICM20689_REG_YG_OFFS_USRH, data[2]);
  sl_icm20689_write_register(ICM20689_REG_YG_OFFS_USRL, data[3]);
  sl_icm20689_write_register(ICM20689_REG_ZG_OFFS_USRH, data[4]);
  sl_icm20689_write_register(ICM20689_REG_ZG_OFFS_USRL, data[5]);

  /* Turn off FIFO */
  sl_icm20689_masked_write(ICM20689_REG_USER_CTRL, 0x00, ICM20689_USER_CTRL_MASK_FIFO_EN);

