espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20689/src/sl_icm20689.c
  /* Disable all sensors */
  sl_icm20689_enable_sensor(false, false, false);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Reads the temperature sensor raw value and converts to Celsius.
 ******************************************************************************/
sl_status_t sl_icm20689_read_temperature_data(float *temperature)
{
  uint8_t data[2];
  int16_t raw_temp;

  /* Read temperature registers */
  sl_icm20689_read_register(ICM20689_REG_TEMP_OUT_H, 2, data);

  /* Convert to int16 */
  raw_temp = (int16_t) ( (data[0] << 8) + data[1]);

  /* Calculate the Celsius value from the raw reading */
  *temperature = ( (float) raw_temp / 333.87) + 21.0;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Reads the device ID of the ICM20689
 ******************************************************************************/
sl_status_t sl_icm20689_get_device_id(uint8_t *dev_id)
{
  sl_icm20689_read_register(ICM20689_REG_WHO_AM_I, 1, dev_id);

  return SL_STATUS_OK;
}

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/***************************************************************************//**
 * @brief
 *    Write data in a register while keeping the non masked bits.
 *
 * @param[in] addr
 *    The register address to write
 *    Bit[7:0] - register address
 *
 * @param[in] data
 *    The data to write to the register
 *
 * @param[in] mask
 *    The mask where data will be written
 *    Bit[7:0] - mask
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
static sl_status_t sl_icm20689_masked_write(uint8_t addr, uint8_t data, uint8_t mask)
{
  uint8_t reg;
  sl_status_t status;

  status = sl_icm20689_read_register(addr, 1, &reg);

  if (status != SL_STATUS_OK) {
    return status;
  }

  // Clear masked bit(s)
  reg &= ~(mask);

  // Write data in the masked space
  reg |= data;

  status = sl_icm20689_write_register(addr, reg);

  return status;
}

/***************************************************************************//**
 * @brief
 *    Controls the state of the ICM20689 SPI chip select pin
 *
 * @param[in] select
 *    The desired state of the select pin. True: asserted (logic L)
 *
 * @return
 *    None
 ******************************************************************************/
static void sl_icm20689_chip_select_set(bool select)
{
  if ( select ) {
    GPIO_PinOutClear(SL_ICM20689_SPI_EUSART_CS_PORT, SL_ICM20689_SPI_EUSART_CS_PIN);
  } else {
    GPIO_PinOutSet(SL_ICM20689_SPI_EUSART_CS_PORT, SL_ICM20689_SPI_EUSART_CS_PIN);
  }
}

/** @endcond */
